import { GenerateFirstQuestionDto } from 'src/modules/haven-ai-agent/dto/generate-first-question.dto';

export const ukrain_Olena: GenerateFirstQuestionDto = {
  name: 'Olena',
  familyName: 'Kovalenko',
  email: 'olena.kovalenko@example.com',
  gender: 'Female',
  highestEducation: "Master's Degree",
  languages: ['Ukrainian', 'Russian', 'English'],
  myStory:
    'Як кваліфікована програмістка з України, моя подорож до статусу біженця в Канаді була сформована в результаті турбот та змітних змін в моїй батьківщині, викликаних військовим конфліктом. Народжена та виростала в живому місті Києві, моє життя колись було сповнене обіцянок та амбіцій. Проте, настання конфлікту розтрощило наше відчуття безпеки, загрожуючи не лише безпеці моєї родини, але й стабільності моїх карєрних амбіцій. Поміж хаосом та несигурністю ми, моя родина та я, зіткнулися з неймовірними викликами. Змушені втекти зі свого дому, ми пережили важкість переміщення та біль залишати позаду все, що нам було дороге. Однак, в обличчі складнощів, ми трималися надії та стійкості, вирішені створити новий шлях вперед. Руханий бажанням безпеки та можливістью відновити наше життя, ми звернулися до Канади для отримання притулку. Рішення покинути нашу батьківщину було непростим, але нас підштовхнуло обіцянкою радушного співтовариства та можливістю внести свій внесок у суспільство, яке цінує різноманітність та інновації. Прибувши у Ванкувер, Британська Колумбія, ми зустрілися із збудженням та тривогою. Шлях до переселення був повний викликів, від подолання бюрократичних перешкод до адаптації до нової культури та способу життя. Проте, завдяки наполегливості та впертості, ми прийняли можливість почати заново, здобуваючи силу від стійкості тих, хто йшов перед нами. Розташовуючись у нашому новому домі, я вдячна за можливість використати свої навички у сфері ІТ для внесення свого внеску у розвиток технологічного сектору в Британській Колумбії. Мої досвіди сформували мій погляд на життя, вбачаючи в них глибоке вдячність за стійкість людського духу та силу спільноти. Незважаючи на те, що шрами війни можуть лишитися, вони стали нагадуванням про силу, яка притаманна кожному з нас.',
  countryOfBirth: 'Ukraine',
  familyStructure: 'Family',
  howManyPeopleInYourGroup: 3,
  resettlementProvinceOrTerritory: 'British Columbia',
  stageOfResettlement:
    'I have a CUAET (Canadian Urgent Appeal for Entry) or another Humanitarian visa and I am currently in Canada',
  resettlementCity: 'Vancouver',
  currentCity: 'Kyiv',
  currentCountry: 'Ukraine',
  currentProvinceOrTerritory: 'Kyiv',
};
